Revit 2024 API
GroupTypeId.EnergyAnalysisAdvanced Property
 Advanced.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId EnergyAnalysisAdvanced { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisAdvanced As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisAdvanced {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace